package day13.homework;

public class PhoneEx01 {

	public static void main(String[] args) {
		/* 연락처 관리를 위한 프로그램을 만드세요.
		 * 메뉴
		 * 1. 연락처 추가  //이름은 중복되도 번호는 중복되면 안됨
		 * 2. 연락처 수정  //수정하는 번호가 이미 있으면 있다고 처리
		 * 3. 연락처 삭제 // 
		 * 4. 연락처 검색 // 엔터만 치면 전체 검색
		 * 5. 프로그램 종료
		 * 메뉴 선택 : 1
		 * -----------
		 * 이름 : 홍길동
		 * 번호 : 010-1231-2333
		 * -----------
		 * 등록이 완료됐습니다.
		 * 메뉴 선택 : 1
		 * -----------
		 * 이름 : 홍길동
		 * 번호 : 010-1234-2333
		 * -----------
		 * 등록이 완료됐습니다.
		 * 메뉴 선택 : 1
		 * -----------
		 * 이름 : 고길동
		 * 번호 : 010-1234-2333
		 * -----------
		 * 이미 등록된 번호입니다.         //번호는 중복되면 안됨
		 * 메뉴 선택 : 2
		 * 이름 : 홍
		 * 1. 홍길동 : 010-1231-2333
		 * 2. 홍길동 : 010-1234-2333
		 * 번호 선택 : 1
		 * 이름 : 홍길동
		 * 번호 : 010-1242-2345
		 * --------------------
		 * 메뉴 선택 : 3
		 * 이름 : 홍
		 * 1. 홍..
		 * 2. 홍..
		 * 삭제할 번호 선택 : 1
		 * 번호를 삭제했습니다.
		 */
	}

}
